Repository: xcv58/MacTools
Catalog: Plugins/Appearance/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# error.modeUnavailable
source: 当前 macOS 无法直接设置自动外观。
ar: لا يمكن لإصدار macOS هذا ضبط المظهر التلقائي مباشرة.
de: Diese macOS-Version kann das automatische Erscheinungsbild nicht direkt festlegen.
en: This macOS version cannot set automatic appearance directly.
es: Esta versión de macOS no puede configurar la apariencia automática directamente.
fr: Cette version macOS ne peut pas définir directement l'apparence automatique.
ja: この macOS バージョンでは、外観を直接「自動」に設定できません。
ko: 이 macOS 버전에서는 화면 모드를 ‘자동’으로 직접 설정할 수 없습니다.
pt: Esta versão do macOS não pode definir a aparência automática diretamente.
ru: В этой версии macOS нельзя напрямую включить автоматическое переключение оформления.
tr: Bu macOS sürümünde otomatik görünüm doğrudan ayarlanamıyor.
zh_hant: 目前 macOS 無法直接設定自動外觀。

# error.modeVerificationRestored
source: 外观验证失败，已恢复原模式。
ar: فشل التحقق من المظهر. تمت استعادة الوضع الأصلي.
de: Überprüfung des Erscheinungsbilds fehlgeschlagen. Der ursprüngliche Modus wurde wiederhergestellt.
en: Appearance verification failed. The original mode was restored.
es: Error en la verificación de apariencia. Se restauró el modo original.
fr: La vérification de l'apparence a échoué. Le mode d'origine a été restauré.
ja: 外観設定の確認に失敗しました。元のモードに戻しました。
ko: 화면 모드 확인에 실패했습니다. 원래 모드가 복원되었습니다.
pt: Falha na verificação de aparência. O modo original foi restaurado.
ru: Не удалось проверить режим оформления. Исходный режим восстановлен.
tr: Görünüm doğrulaması başarısız oldu. Özgün mod geri yüklendi.
zh_hant: 外觀驗證失敗，已還原原本的模式。

# error.modeVerificationUnrestored
source: 外观验证失败，恢复原模式未完成。
ar: فشل التحقق من المظهر. تعذرت استعادة الوضع الأصلي بالكامل.
de: Überprüfung des Erscheinungsbilds fehlgeschlagen. Der ursprüngliche Modus konnte nicht vollständig wiederhergestellt werden.
en: Appearance verification failed. The original mode could not be fully restored.
es: Error en la verificación de apariencia. No se pudo restaurar completamente el modo original.
fr: La vérification de l'apparence a échoué. Le mode d'origine n'a pas pu être entièrement restauré.
ja: 外観設定の確認に失敗しました。元のモードを完全に復元できませんでした。
ko: 화면 모드 확인에 실패했습니다. 원래 모드를 완전히 복원하지 못했습니다.
pt: Falha na verificação de aparência. O modo original não pôde ser totalmente restaurado.
ru: Не удалось проверить режим оформления. Исходный режим не удалось полностью восстановить.
tr: Görünüm doğrulaması başarısız oldu. Özgün mod tam olarak geri yüklenemedi.
zh_hant: 外觀驗證失敗，未能完整還原原本的模式。

# parameter.mode.title
source: 外观
ar: المظهر
de: Erscheinungsbild
en: Appearance
es: Apariencia
fr: Apparence
ja: 外観
ko: 화면 모드
pt: Aparência
ru: Оформление
tr: Görünüm
zh_hant: 外觀

# action.setMode.title
source: 设置系统外观
ar: ضبط مظهر النظام
de: System-Erscheinungsbild festlegen
en: Set System Appearance
es: Configurar la apariencia del sistema
fr: Définir l'apparence du système
ja: システムの外観を設定する
ko: 시스템 화면 모드 설정
pt: Definir aparência do sistema
ru: Настроить оформление системы
tr: Sistem Görünümünü Ayarla
zh_hant: 設定系統外觀

# action.setMode.description
source: 选择自动、浅色或深色系统外观。
ar: اختر المظهر التلقائي أو الفاتح أو الداكن للنظام.
de: Wählen Sie das automatische, helle oder dunkle System-Erscheinungsbild.
en: Choose automatic, light, or dark system appearance.
es: Elija la apariencia del sistema automática, clara u oscura.
fr: Choisissez l'apparence du système automatique, claire ou sombre.
ja: システムの外観を「自動」、「ライト」、「ダーク」から選択します。
ko: 시스템 화면 모드를 자동, 라이트 또는 다크 모드로 설정합니다.
pt: Escolha a aparência do sistema automática, clara ou escura.
ru: Выберите светлое или темное оформление системы либо автоматическое переключение между ними.
tr: Otomatik, aydınlık veya karanlık sistem görünümünü seçin.
zh_hant: 選擇自動、淺色或深色系統外觀。

# action.mode.auto
source: 系统外观：自动
ar: مظهر النظام: تلقائي
de: System-Erscheinungsbild: Automatisch
en: System Appearance: Auto
es: Apariencia del sistema: Automática
fr: Apparence du système : Auto
ja: システムの外観: 自動
ko: 시스템 화면 모드: 자동
pt: Aparência do sistema: automática
ru: Оформление системы: автоматически
tr: Sistem Görünümü: Otomatik
zh_hant: 系統外觀：自動

# action.mode.light
source: 系统外观：浅色
ar: مظهر النظام: فاتح
de: Systemdarstellung: Hell
en: System Appearance: Light
es: Apariencia del sistema: Clara
fr: Apparence du système : claire
ja: システムの外観: ライト
ko: 시스템 화면 모드: 라이트
pt: Aparência do sistema: clara
ru: Оформление системы: светлое
tr: Sistem Görünümü: Aydınlık
zh_hant: 系統外觀：淺色

# action.mode.dark
source: 系统外观：深色
ar: مظهر النظام: داكن
de: System-Erscheinungsbild: Dunkel
en: System Appearance: Dark
es: Apariencia del sistema: Oscura
fr: Apparence du système : sombre
ja: システムの外観: ダーク
ko: 시스템 화면 모드: 다크
pt: Aparência do sistema: escura
ru: Оформление системы: темное
tr: Sistem Görünümü: Karanlık
zh_hant: 系統外觀：深色

# error.toggleFailed
source: 切换系统外观失败。
ar: تعذر تبديل مظهر النظام.
de: Das Systemerscheinungsbild konnte nicht gewechselt werden.
en: Failed to switch the system appearance.
es: No se pudo cambiar la apariencia del sistema.
fr: Impossible de changer l’apparence du système.
ja: システムの外観を切り替えられませんでした。
ko: 시스템 모양을 전환할 수 없습니다.
pt: Não foi possível alternar a aparência do sistema.
ru: Не удалось изменить оформление системы.
tr: Sistem görünümü değiştirilemedi.
zh_hant: 切換系統外觀失敗。

# action.enableDark.title
source: 启用深色模式
ar: تشغيل الوضع الداكن
de: Dunkelmodus aktivieren
en: Turn On Dark Mode
es: Activar modo oscuro
fr: Activer le mode sombre
ja: ダークモードにする
ko: 다크 모드 켜기
pt: Ativar modo escuro
ru: Включить темный режим
tr: Karanlık Modu Aç
zh_hant: 啟用深色模式

# action.enableLight.title
source: 启用浅色模式
ar: تشغيل الوضع الفاتح
de: Hellen Modus aktivieren
en: Turn On Light Mode
es: Activar modo claro
fr: Activer le mode clair
ja: ライトモードにする
ko: 라이트 모드 켜기
pt: Ativar modo claro
ru: Включить светлый режим
tr: Aydınlık Modu Aç
zh_hant: 啟用淺色模式

# metadata.title
source: 深色模式
ar: الوضع الداكن
de: Dunkler Modus
en: Dark Mode
es: Modo oscuro
fr: Mode sombre
ja: ダークモード
ko: 다크 모드
pt: Modo escuro
ru: Темный режим
tr: Karanlık Mod

# metadata.description
source: 切换系统亮色与深色外观
ar: التبديل بين مظهر النظام الفاتح والداكن.
de: Wechseln Sie zwischen heller und dunkler Systemdarstellung.
en: Switch between light and dark system appearance.
es: Cambia entre la apariencia del sistema clara y oscura.
fr: Basculez entre l'apparence claire et sombre du système.
ja: システムの外観を明暗で切り替えます。
ko: 밝은 시스템 모양과 어두운 시스템 모양 사이를 전환합니다.
pt: Alternar entre a aparência clara e escura do sistema.
ru: Переключение между светлым и темным внешним видом системы.
tr: Aydınlık ve karanlık sistem görünümü arasında geçiş yapın.
zh_hant: 切換系統亮色與深色外觀

# panel.subtitle.enabled
source: 已开启
ar: تشغيل
de: Ein
en: On
es: Activado
fr: Activé
ja: オン
ko: 켜기
pt: Ativado
ru: Включено
tr: Açık
zh_hant: 已開啟

# panel.subtitle.disabled
source: 已关闭
ar: إيقاف
de: Aus
en: Off
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desligado
ru: Выкл.
tr: Kapalı
zh_hant: 已關閉

# permission.automation.description
source: 切换系统外观时需要控制系统事件。
ar: يتطلب تبديل مظهر النظام التحكم في أحداث النظام.
de: Zum Wechseln des System-Erscheinungsbilds muss „System Events“ gesteuert werden.
en: Switching system appearance requires controlling System Events.
es: Cambiar la apariencia del sistema requiere controlar Eventos del Sistema.
fr: Changer l’apparence du système nécessite de contrôler Événements système.
ja: システムの外観を切り替えるには、「システムイベント」の制御が必要です。
ko: 시스템 모드를 전환하려면 ‘시스템 이벤트’를 제어해야 합니다.
pt: Alterar a aparência do sistema requer o controle dos Eventos do Sistema.
ru: Для переключения оформления системы требуется управление приложением «Системные события».
tr: Sistem görünümünü değiştirmek System Events'i denetlemeyi gerektirir.
zh_hant: 切換系統外觀時需要控制「系統事件」。

# permission.automation.footnote
source: macOS 会在首次使用时请求自动化授权。
ar: سيطلب macOS إذن الأتمتة عند الاستخدام للمرة الأولى.
de: macOS fragt bei der ersten Verwendung nach der Automation-Berechtigung.
en: macOS will request Automation access the first time this is used.
es: macOS solicitará acceso de automatización la primera vez que se use.
fr: macOS demandera l’autorisation d’automatisation lors de la première utilisation.
ja: 初回使用時に、macOSがオートメーションの許可を求めます。
ko: 처음 사용할 때 macOS가 자동화 권한을 요청합니다.
pt: O macOS solicitará acesso à Automação na primeira utilização.
ru: При первом использовании macOS запросит доступ к автоматизации.
tr: macOS, bu özellik ilk kez kullanıldığında Otomasyon erişimi isteyecek.
zh_hant: macOS 會在首次使用時要求自動化授權。

# permission.automation.title
source: 自动化
ar: الأتمتة
de: Automation
en: Automation
es: Automatización
fr: Automatisation
ja: オートメーション
ko: 자동화
pt: Automação
ru: Автоматизация
tr: Otomasyon
zh_hant: 自動化

# permission.automation.status
source: 按需确认
ar: تأكيد عند الاستخدام
de: Bestätigung bei Verwendung
en: Confirm on Use
es: Confirmar al usar
fr: Confirmation à l’utilisation
ja: 使用時に確認
ko: 사용 시 확인
pt: Confirmar ao usar
ru: Подтверждение при использовании
tr: Kullanırken Onayla
zh_hant: 按需確認
